app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '955b6e6dc393ef8c7dc4c4d90cbb2f9c712f5e9e', '2010-03-20 18:25:43', 'ef394001280e624a0472d497041b799784c648c2', NULL, '2010-03-20 18:25:43', NULL, 'quire', 'quire@example.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save